/*
 *                   ___====-_  _-====___
 *             _--^^^#####//      \\#####^^^--_
 *          _-^##########// (    ) \\##########^-_
 *         -############//  |\^^/|  \\############-
 *       _/############//   (@::@)   \############\_
 *      /#############((     \\//     ))#############\
 *     -###############\\    (oo)    //###############-
 *    -#################\\  / VV \  //#################-
 *   -###################\\/      \//###################-
 *  _#/|##########/\######(   /\   )######/\##########|\#_
 *  |/ |#/\#/\#/\/  \#/\##\  |  |  /##/\#/  \/\#/\#/\#| \|
 *  `  |/  V  V  `   V  \#\| |  | |/#/  V   '  V  V  \|  '
 *     `   `  `      `   / | |  | | \   '      '  '   '
 *                      (  | |  | |  )
 *                     __\ | |  | | /__
 *                    (vvv(VVV)(VVV)vvv)
 *
 *      ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 *
 *                神兽保佑            永无BUG
 */

/*
 * @Author: 矢车
 * @Date: 2020-11-16 15:20:50
 * @LastEditors: 矢车
 * @LastEditTime: 2020-12-18 10:55:44
 * @Description: 全局方法
 */

export default {
  /**
   * @Author: 矢车
   * @Date: 2020-11-16 15:21:03
   * @Description: 限定输入框只允许输入中文字符
   */
  inputChinese: (e: any): string => {
    return e.target.value.replace(/[^\u4E00-\u9FA5]/g, ''); // 清除除了中文以外的输入的字符
  },

  /**
   * @Author: 矢车
   * @Date: 2020-11-18 14:33:40
   * @Description: 限定输入框只允许输入英文和数字
   */
  inputCharOrNumber: (e: any): string | number => {
    return e.target.value.replace(/[^A-Za-z0-9]/g, '');
  },

  /**
   * @Author: 矢车
   * @Date: 2020-11-18 14:59:44
   * @Description: 限定输入框只能输入数字，标点符号只能输入 '-'
   */
  inputLimit: (e: any): string | string => {
    return e.target.value.replace(/[^-0-9]/g, '');
  },

  /**
   * @Author: 矢车
   * @Date: 2020-11-18 14:59:44
   * @Description: 限定输入框只能输入数字
   */
  inputNumberLimit: (e: any): string | string => {
    return e.target.value.replace(/[^0-9]/g, '');
  },
};
